/** @file
  String definitions for Sio Configuration form.

;******************************************************************************
;* Copyright (c) 2013, Insyde Software Corporation. All Rights Reserved.
;*
;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
;* transmit, broadcast, present, recite, release, license or otherwise exploit
;* any part of this publication in any form, by any means, without the prior
;* written permission of Insyde Software Corporation.
;*
;******************************************************************************
*/

#langdef en-US "en-USlish"
#langdef fr-FR "fr-FRncais"

#string STR_DEVICE_PATH                 #language en-US        ""

#string STR_SIO_TITLE                   #language en-US        "SIO"
                                        #language fr-FR        "SIO"
#string STR_SIO_NUVOTON5104D_TITLE      #language en-US        "SIO NCT5104D"
                                        #language fr-FR        "SIO NCT5104D"

#string STR_SIO_TITLE_HELP              #language en-US        "About SuperIO Setting"
                                        #language fr-FR        "About SuperIO Setting"

#string STR_SIO_BAUD_RATE               #language en-US        "Select The Baud Rate"
                                        #language fr-FR        "Select The Baud Rate"
#string STR_SIO_BAUD_HELP               #language en-US        "Set the Baud Rate"
                                        #language fr-FR        "Set the Baud Rate"

#string STR_SIO_SERIAL_PORT             #language en-US        "Serial Port"
                                        #language fr-FR        "Serial Port"
#string STR_SIO_SERIAL_PORTA            #language en-US        "Serial Port A"
                                        #language fr-FR        "Serial Port A"
#string STR_SIO_SERIAL_PORTB            #language en-US        "Serial Port B"
                                        #language fr-FR        "Serial Port B"
#string STR_SIO_SERIAL_PORTC            #language en-US        "Serial Port C"
                                        #language fr-FR        "Serial Port C"
#string STR_SIO_SERIAL_PORTD            #language en-US        "Serial Port D"
                                        #language fr-FR        "Serial Port D"
#string STR_SIO_SERIAL_PORTE            #language en-US        "Serial Port E"
                                        #language fr-FR        "Serial Port E"
#string STR_SIO_SERIAL_PORTF            #language en-US        "Serial Port F"
                                        #language fr-FR        "Serial Port F"

#string STR_SIO_LPT_PORT                #language en-US        "LPT Port"
                                        #language fr-FR        "LPT Port"
#string STR_SIO_LPT_PORTA               #language en-US        "LPT Port A"
                                        #language fr-FR        "LPT Port A"
#string STR_SIO_LPT_PORTB               #language en-US        "LPT Port B"
                                        #language fr-FR        "LPT Port B"
                                        
#string STR_SIO_CIR                     #language en-US        "CIR"
                                        #language fr-FR        "CIR"
#string STR_SIO_IR                      #language en-US        "IR"
                                        #language fr-FR        "IR"     
#string STR_SIO_CIR_HELP                #language en-US        "CIR is used in the consumer remote control equipment, and is a programmable amplitude shift keyed (ASK) serial communication protocol"
                                        #language fr-FR        "CIR is used in the consumer remote control equipment, and is a programmable amplitude shift keyed (ASK) serial communication protocol"
#string STR_SIO_IR_HELP                 #language en-US        "Infrared Remote, Support IrDA version 1.0 SIR protocol with maximum baud rate up to 115.2K bps"
                                        #language fr-FR        "Infrared Remote, Support IrDA version 1.0 SIR protocol with maximum baud rate up to 115.2K bps"                                                                              

#string STR_SIO_SERIAL_HELP             #language en-US        "Configure Serial port using options : [Disable] No Configuration [Enable] User Configuration [Auto] EFI/OS chooses configuration"
                                        #language fr-FR        "Configurer le port de Serie en utilisant: [Desactivé] Pas de Configuration [Activé] Configuration Utilisateur [Auto] EFI/OS selectionne la configuration"
#string STR_SIO_LPT_HELP                #language en-US        "Configure LPT port using options : [Disable] No Configuration [Enable] User Configuration [Auto] EFI/OS chooses configuration"
                                        #language fr-FR        "Configurer LPT de Serie en utilisant: [Desactivé] Pas de Configuration [Activé] Configuration Utilisateur [Auto] EFI/OS selectionne la configuration"

#string STR_SIO_BASEIO_STRING           #language en-US        "  Base I/O Address"
                                        #language fr-FR        "  I/O Address de Base"
#string STR_SIO_INTERRUPT_STRING        #language en-US        "  Interrupt"
                                        #language fr-FR        "  Interrompre"
#string STR_SIO_DMA_CHANNEL_STRING      #language en-US        "  DMA Channel"
                                        #language fr-FR        "  DMA Channel"

#string STR_SIO_3F8_TEXT                #language en-US        "3F8"
                                        #language fr-FR        "3F8"
#string STR_SIO_2F8_TEXT                #language en-US        "2F8"
                                        #language fr-FR        "2F8"
#string STR_SIO_3E8_TEXT                #language en-US        "3E8"
                                        #language fr-FR        "3E8"
#string STR_SIO_2E8_TEXT                #language en-US        "2E8"
                                        #language fr-FR        "2E8"
#string STR_SIO_3E0_TEXT                #language en-US        "3E0"
                                        #language fr-FR        "3E0"
#string STR_SIO_2E0_TEXT                #language en-US        "2E0"
                                        #language fr-FR        "2E0"
#string STR_SIO_2F0_TEXT                #language en-US        "2F0"
                                        #language fr-FR        "2F0"
#string STR_SIO_338_TEXT                #language en-US        "338"
                                        #language fr-FR        "338"
#string STR_SIO_228_TEXT                #language en-US        "228"
                                        #language fr-FR        "228"
#string STR_SIO_378_TEXT                #language en-US        "378"
                                        #language fr-FR        "378"
#string STR_SIO_388_TEXT                #language en-US        "388"
                                        #language fr-FR        "388"
#string STR_SIO_310_TEXT                #language en-US        "310"
                                        #language fr-FR        "310"
#string STR_SIO_320_TEXT                #language en-US        "320"
                                        #language fr-FR        "320"                                        

#string STR_PCI_IRQ3_TEXT               #language en-US        "IRQ3"
                                        #language fr-FR        "IRQ3"
#string STR_PCI_IRQ4_TEXT               #language en-US        "IRQ4"
                                        #language fr-FR        "IRQ4"
#string STR_PCI_IRQ5_TEXT               #language en-US        "IRQ5"
                                        #language fr-FR        "IRQ5"
#string STR_PCI_IRQ6_TEXT               #language en-US        "IRQ6"
                                        #language fr-FR        "IRQ6"
#string STR_PCI_IRQ7_TEXT               #language en-US        "IRQ7"
                                        #language fr-FR        "IRQ7"
#string STR_PCI_IRQ9_TEXT               #language en-US        "IRQ9"
                                        #language fr-FR        "IRQ9"
#string STR_PCI_IRQ10_TEXT              #language en-US        "IRQ10"
                                        #language fr-FR        "IRQ10"
#string STR_PCI_IRQ11_TEXT              #language en-US        "IRQ11"
                                        #language fr-FR        "IRQ11"
#string STR_PCI_IRQ12_TEXT              #language en-US        "IRQ12"
                                        #language fr-FR        "IRQ12"
#string STR_PCI_IRQ13_TEXT              #language en-US        "IRQ13"
                                        #language fr-FR        "IRQ13"
#string STR_PCI_IRQ14_TEXT              #language en-US        "IRQ14"
                                        #language fr-FR        "IRQ14"
#string STR_PCI_IRQ15_TEXT              #language en-US        "IRQ15"
                                        #language fr-FR        "IRQ15"
#string STR_PCI_IRQ16_TEXT              #language en-US        "IRQ16"
                                        #language fr-FR        "IRQ16"                                                                                                                                                                                                                                             

#string STR_SIO_BAUD_RATE               #language en-US        "Baud Rate"
                                        #language fr-FR        "Baud Rate"
#string STR_SIO_BAUD_RATE_115200        #language en-US        "115200"
                                        #language fr-FR        "115200"
#string STR_SIO_BAUD_RATE_57600         #language en-US        " 57600"
                                        #language fr-FR        " 57600"
#string STR_SIO_BAUD_RATE_38400         #language en-US        " 38400"
                                        #language fr-FR        " 38400"
#string STR_SIO_BAUD_RATE_19200         #language en-US        " 19200"
                                        #language fr-FR        " 19200"
#string STR_SIO_BAUD_RATE_9600          #language en-US        "  9600"
                                        #language fr-FR        "  9600"
#string STR_SIO_BAUD_RATE_4800          #language en-US        "  4800"
                                        #language fr-FR        "  4800"
#string STR_SIO_BAUD_RATE_2400          #language en-US        "  2400"
                                        #language fr-FR        "  2400"
#string STR_SIO_BAUD_RATE_1200          #language en-US        "  1200"
                                        #language fr-FR        "  1200"
#string STR_SIO_BAUD_RATE_300           #language en-US        "   300"
                                        #language fr-FR        "   300"

#string STR_SIO_SELECT_AUTO             #language en-US        "AUTO"
                                        #language fr-FR        "AUTO"
#string STR_SIO_SELECT_ENABLE           #language en-US        "Enable"
                                        #language fr-FR        "Enable"
#string STR_SIO_SELECT_DISABLE          #language en-US        "Disable"
                                        #language fr-FR        "Disable"

#string STR_SIO_WDT                     #language en-US        "WDT"
                                        #language fr-FR        "WDT"
#string STR_SIO_SELECT_MICROSECOND      #language en-US        "MICROSECOND"
                                        #language fr-FR        "MICROSECOND"                                        
#string STR_SIO_SELECT_SECOND           #language en-US        "SECOND"
                                        #language fr-FR        "SECOND"
#string STR_SIO_SELECT_MINUTE           #language en-US        "MINUTE"
                                        #language fr-FR        "MINUTE"
#string STR_SIO_SELECT_MODE_HELP        #language en-US        "Select count mode"
                                        #language fr-FR        "Select count mode"
#string STR_SIO_WDT_COUNTER             #language en-US        "COUNTER"
                                        #language fr-FR        "COUNTER"
#string STR_SIO_WDT_COUNTER_HELP        #language en-US        "The time-out counter ranges from 15 to 255 minutes in the minute mode, or 15 to 255 seconds in the second mode."
                                        #language fr-FR        "The time-out counter ranges from 15 to 255 minutes in the minute mode, or 15 to 255 seconds in the second mode."

#string FUNCTION_NINE_STRING            #language en-US         "F9=Reset to Defaults"
                                        #language fr-FR         "F9=Reset à Défauts"
#string FUNCTION_TEN_STRING             #language en-US         "F10=Save"
                                        #language fr-FR         "F10=Économiser"

#string STR_SAVE_CHANGES                #language en-US        "Save Changes and Exit"
                                        #language fr-FR        "Save Changes and Exit"

#string STR_SIO_ESC                     #language en-US        "Press ESC to exit."
                                        #language fr-FR        "Press ESC to exit."
#string STR_SIO_EMPTY                   #language en-US        ""
                                        #language fr-FR        ""

#string STR_SIO_COM_TYPE                #language en-US        "  Type"
                                        #language fr-FR        "TYPE" 
#string STR_SIO_COM_RS232               #language en-US        "RS232"
                                        #language fr-FR        "RS232"   
#string STR_SIO_COM_RS485               #language en-US        "RS485"
                                        #language fr-FR        "RS485"   
#string STR_SIO_COM_TYPE_HELP           #language en-US        "Choose RS232/RS485(Peer-to-Peer) for COM type"
                                        #language fr-FR        "Choose RS232/RS485(Peer-to-Peer) for COM type"                                            
                                            